RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b110f2048gm64.h
/* Bit fields for MSC IFS */
#define _MSC_IFS_RESETVALUE                               0x00000000UL                       /**< Default value for MSC_IFS */
#define _MSC_IFS_MASK                                     0x000F017FUL                       /**< Mask for MSC_IFS */
#define MSC_IFS_ERASE                                     (0x1UL << 0)                       /**< Set ERASE Interrupt Flag */
#define _MSC_IFS_ERASE_SHIFT                              0                                  /**< Shift value for MSC_ERASE */
#define _MSC_IFS_ERASE_MASK                               0x1UL                              /**< Bit mask for MSC_ERASE */
#define _MSC_IFS_ERASE_DEFAULT                            0x00000000UL                       /**< Mode DEFAULT for MSC_IFS */
#define MSC_IFS_ERASE_DEFAULT                             (_MSC_IFS_ERASE_DEFAULT << 0)      /**< Shifted mode DEFAULT for MSC_IFS */
#define MSC_IFS_WRITE                                     (0x1UL << 1)                       /**< Set WRITE Interrupt Flag */
#define _MSC_IFS_WRITE_SHIFT                              1                                  /**< Shift value for MSC_WRITE */
#define _MSC_IFS_WRITE_MASK                               0x2UL                              /**< Bit mask for MSC_WRITE */
#define _MSC_IFS_WRITE_DEFAULT                            0x00000000UL                       /**< Mode DEFAULT for MSC_IFS */
#define MSC_IFS_WRITE_DEFAULT                             (_MSC_IFS_WRITE_DEFAULT << 1)      /**< Shifted mode DEFAULT for MSC_IFS */
#define MSC_IFS_CHOF                                      (0x1UL << 2)                       /**< Set CHOF Interrupt Flag */
#define _MSC_IFS_CHOF_SHIFT                               2                                  /**< Shift value for MSC_CHOF */
#define _MSC_IFS_CHOF_MASK                                0x4UL                              /**< Bit mask for MSC_CHOF */
#define _MSC_IFS_CHOF_DEFAULT                             0x00000000UL                       /**< Mode DEFAULT for MSC_IFS */
#define MSC_IFS_CHOF_DEFAULT                              (_MSC_IFS_CHOF_DEFAULT << 2)       /**< Shifted mode DEFAULT for MSC_IFS */
#define MSC_IFS_CMOF                                      (0x1UL << 3)                       /**< Set CMOF Interrupt Flag */
#define _MSC_IFS_CMOF_SHIFT                               3                                  /**< Shift value for MSC_CMOF */
#define _MSC_IFS_CMOF_MASK                                0x8UL                              /**< Bit mask for MSC_CMOF */
#define _MSC_IFS_CMOF_DEFAULT                             0x00000000UL                       /**< Mode DEFAULT for MSC_IFS */
#define MSC_IFS_CMOF_DEFAULT                              (_MSC_IFS_CMOF_DEFAULT << 3)       /**< Shifted mode DEFAULT for MSC_IFS */
#define MSC_IFS_PWRUPF                                    (0x1UL << 4)                       /**< Set PWRUPF Interrupt Flag */
#define _MSC_IFS_PWRUPF_SHIFT                             4                                  /**< Shift value for MSC_PWRUPF */
#define _MSC_IFS_PWRUPF_MASK                              0x10UL                             /**< Bit mask for MSC_PWRUPF */
#define _MSC_IFS_PWRUPF_DEFAULT                           0x00000000UL                       /**< Mode DEFAULT for MSC_IFS */
#define MSC_IFS_PWRUPF_DEFAULT                            (_MSC_IFS_PWRUPF_DEFAULT << 4)     /**< Shifted mode DEFAULT for MSC_IFS */
#define MSC_IFS_ICACHERR                                  (0x1UL << 5)                       /**< Set ICACHERR Interrupt Flag */
#define _MSC_IFS_ICACHERR_SHIFT                           5                                  /**< Shift value for MSC_ICACHERR */
#define _MSC_IFS_ICACHERR_MASK                            0x20UL                             /**< Bit mask for MSC_ICACHERR */
#define _MSC_IFS_ICACHERR_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for MSC_IFS */
#define MSC_IFS_ICACHERR_DEFAULT                          (_MSC_IFS_ICACHERR_DEFAULT << 5)   /**< Shifted mode DEFAULT for MSC_IFS */
#define MSC_IFS_WDATAOV                                   (0x1UL << 6)                       /**< Set WDATAOV Interrupt Flag */
#define _MSC_IFS_WDATAOV_SHIFT                            6                                  /**< Shift value for MSC_WDATAOV */
#define _MSC_IFS_WDATAOV_MASK                             0x40UL                             /**< Bit mask for MSC_WDATAOV */
#define _MSC_IFS_WDATAOV_DEFAULT                          0x00000000UL                       /**< Mode DEFAULT for MSC_IFS */
#define MSC_IFS_WDATAOV_DEFAULT                           (_MSC_IFS_WDATAOV_DEFAULT << 6)    /**< Shifted mode DEFAULT for MSC_IFS */
#define MSC_IFS_LVEWRITE                                  (0x1UL << 8)                       /**< Set LVEWRITE Interrupt Flag */
#define _MSC_IFS_LVEWRITE_SHIFT                           8                                  /**< Shift value for MSC_LVEWRITE */
#define _MSC_IFS_LVEWRITE_MASK                            0x100UL                            /**< Bit mask for MSC_LVEWRITE */
#define _MSC_IFS_LVEWRITE_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for MSC_IFS */
#define MSC_IFS_LVEWRITE_DEFAULT                          (_MSC_IFS_LVEWRITE_DEFAULT << 8)   /**< Shifted mode DEFAULT for MSC_IFS */
#define MSC_IFS_RAMERR1B                                  (0x1UL << 16)                      /**< Set RAMERR1B Interrupt Flag */
#define _MSC_IFS_RAMERR1B_SHIFT                           16                                 /**< Shift value for MSC_RAMERR1B */
#define _MSC_IFS_RAMERR1B_MASK                            0x10000UL                          /**< Bit mask for MSC_RAMERR1B */
#define _MSC_IFS_RAMERR1B_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for MSC_IFS */
#define MSC_IFS_RAMERR1B_DEFAULT                          (_MSC_IFS_RAMERR1B_DEFAULT << 16)  /**< Shifted mode DEFAULT for MSC_IFS */
#define MSC_IFS_RAMERR2B                                  (0x1UL << 17)                      /**< Set RAMERR2B Interrupt Flag */
#define _MSC_IFS_RAMERR2B_SHIFT                           17                                 /**< Shift value for MSC_RAMERR2B */
#define _MSC_IFS_RAMERR2B_MASK                            0x20000UL                          /**< Bit mask for MSC_RAMERR2B */
#define _MSC_IFS_RAMERR2B_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for MSC_IFS */
#define MSC_IFS_RAMERR2B_DEFAULT                          (_MSC_IFS_RAMERR2B_DEFAULT << 17)  /**< Shifted mode DEFAULT for MSC_IFS */
#define MSC_IFS_RAM1ERR1B                                 (0x1UL << 18)                      /**< Set RAM1ERR1B Interrupt Flag */
#define _MSC_IFS_RAM1ERR1B_SHIFT                          18                                 /**< Shift value for MSC_RAM1ERR1B */
#define _MSC_IFS_RAM1ERR1B_MASK                           0x40000UL                          /**< Bit mask for MSC_RAM1ERR1B */
#define _MSC_IFS_RAM1ERR1B_DEFAULT                        0x00000000UL                       /**< Mode DEFAULT for MSC_IFS */
#define MSC_IFS_RAM1ERR1B_DEFAULT                         (_MSC_IFS_RAM1ERR1B_DEFAULT << 18) /**< Shifted mode DEFAULT for MSC_IFS */
#define MSC_IFS_RAM1ERR2B                                 (0x1UL << 19)                      /**< Set RAM1ERR2B Interrupt Flag */
#define _MSC_IFS_RAM1ERR2B_SHIFT                          19                                 /**< Shift value for MSC_RAM1ERR2B */
#define _MSC_IFS_RAM1ERR2B_MASK                           0x80000UL                          /**< Bit mask for MSC_RAM1ERR2B */
#define _MSC_IFS_RAM1ERR2B_DEFAULT                        0x00000000UL                       /**< Mode DEFAULT for MSC_IFS */
#define MSC_IFS_RAM1ERR2B_DEFAULT                         (_MSC_IFS_RAM1ERR2B_DEFAULT << 19) /**< Shifted mode DEFAULT for MSC_IFS */

/* Bit fields for MSC IFC */
#define _MSC_IFC_RESETVALUE                               0x00000000UL                       /**< Default value for MSC_IFC */
#define _MSC_IFC_MASK                                     0x000F017FUL                       /**< Mask for MSC_IFC */
#define MSC_IFC_ERASE                                     (0x1UL << 0)                       /**< Clear ERASE Interrupt Flag */
#define _MSC_IFC_ERASE_SHIFT                              0                                  /**< Shift value for MSC_ERASE */
#define _MSC_IFC_ERASE_MASK                               0x1UL                              /**< Bit mask for MSC_ERASE */
#define _MSC_IFC_ERASE_DEFAULT                            0x00000000UL                       /**< Mode DEFAULT for MSC_IFC */
#define MSC_IFC_ERASE_DEFAULT                             (_MSC_IFC_ERASE_DEFAULT << 0)      /**< Shifted mode DEFAULT for MSC_IFC */
#define MSC_IFC_WRITE                                     (0x1UL << 1)                       /**< Clear WRITE Interrupt Flag */
#define _MSC_IFC_WRITE_SHIFT                              1                                  /**< Shift value for MSC_WRITE */
#define _MSC_IFC_WRITE_MASK                               0x2UL                              /**< Bit mask for MSC_WRITE */
#define _MSC_IFC_WRITE_DEFAULT                            0x00000000UL                       /**< Mode DEFAULT for MSC_IFC */
#define MSC_IFC_WRITE_DEFAULT                             (_MSC_IFC_WRITE_DEFAULT << 1)      /**< Shifted mode DEFAULT for MSC_IFC */
#define MSC_IFC_CHOF                                      (0x1UL << 2)                       /**< Clear CHOF Interrupt Flag */
#define _MSC_IFC_CHOF_SHIFT                               2                                  /**< Shift value for MSC_CHOF */
#define _MSC_IFC_CHOF_MASK                                0x4UL                              /**< Bit mask for MSC_CHOF */
#define _MSC_IFC_CHOF_DEFAULT                             0x00000000UL                       /**< Mode DEFAULT for MSC_IFC */
#define MSC_IFC_CHOF_DEFAULT                              (_MSC_IFC_CHOF_DEFAULT << 2)       /**< Shifted mode DEFAULT for MSC_IFC */
#define MSC_IFC_CMOF                                      (0x1UL << 3)                       /**< Clear CMOF Interrupt Flag */
#define _MSC_IFC_CMOF_SHIFT                               3                                  /**< Shift value for MSC_CMOF */
#define _MSC_IFC_CMOF_MASK                                0x8UL                              /**< Bit mask for MSC_CMOF */
#define _MSC_IFC_CMOF_DEFAULT                             0x00000000UL                       /**< Mode DEFAULT for MSC_IFC */
#define MSC_IFC_CMOF_DEFAULT                              (_MSC_IFC_CMOF_DEFAULT << 3)       /**< Shifted mode DEFAULT for MSC_IFC */
#define MSC_IFC_PWRUPF                                    (0x1UL << 4)                       /**< Clear PWRUPF Interrupt Flag */
#define _MSC_IFC_PWRUPF_SHIFT                             4                                  /**< Shift value for MSC_PWRUPF */
#define _MSC_IFC_PWRUPF_MASK                              0x10UL                             /**< Bit mask for MSC_PWRUPF */
#define _MSC_IFC_PWRUPF_DEFAULT                           0x00000000UL                       /**< Mode DEFAULT for MSC_IFC */
#define MSC_IFC_PWRUPF_DEFAULT                            (_MSC_IFC_PWRUPF_DEFAULT << 4)     /**< Shifted mode DEFAULT for MSC_IFC */
#define MSC_IFC_ICACHERR                                  (0x1UL << 5)                       /**< Clear ICACHERR Interrupt Flag */
#define _MSC_IFC_ICACHERR_SHIFT                           5                                  /**< Shift value for MSC_ICACHERR */
#define _MSC_IFC_ICACHERR_MASK                            0x20UL                             /**< Bit mask for MSC_ICACHERR */
#define _MSC_IFC_ICACHERR_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for MSC_IFC */
#define MSC_IFC_ICACHERR_DEFAULT                          (_MSC_IFC_ICACHERR_DEFAULT << 5)   /**< Shifted mode DEFAULT for MSC_IFC */
#define MSC_IFC_WDATAOV                                   (0x1UL << 6)                       /**< Clear WDATAOV Interrupt Flag */
#define _MSC_IFC_WDATAOV_SHIFT                            6                                  /**< Shift value for MSC_WDATAOV */
#define _MSC_IFC_WDATAOV_MASK                             0x40UL                             /**< Bit mask for MSC_WDATAOV */
#define _MSC_IFC_WDATAOV_DEFAULT                          0x00000000UL                       /**< Mode DEFAULT for MSC_IFC */
#define MSC_IFC_WDATAOV_DEFAULT                           (_MSC_IFC_WDATAOV_DEFAULT << 6)    /**< Shifted mode DEFAULT for MSC_IFC */
#define MSC_IFC_LVEWRITE                                  (0x1UL << 8)                       /**< Clear LVEWRITE Interrupt Flag */
#define _MSC_IFC_LVEWRITE_SHIFT                           8                                  /**< Shift value for MSC_LVEWRITE */
#define _MSC_IFC_LVEWRITE_MASK                            0x100UL                            /**< Bit mask for MSC_LVEWRITE */
#define _MSC_IFC_LVEWRITE_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for MSC_IFC */
#define MSC_IFC_LVEWRITE_DEFAULT                          (_MSC_IFC_LVEWRITE_DEFAULT << 8)   /**< Shifted mode DEFAULT for MSC_IFC */
#define MSC_IFC_RAMERR1B                                  (0x1UL << 16)                      /**< Clear RAMERR1B Interrupt Flag */
#define _MSC_IFC_RAMERR1B_SHIFT                           16                                 /**< Shift value for MSC_RAMERR1B */
#define _MSC_IFC_RAMERR1B_MASK                            0x10000UL                          /**< Bit mask for MSC_RAMERR1B */
#define _MSC_IFC_RAMERR1B_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for MSC_IFC */
#define MSC_IFC_RAMERR1B_DEFAULT                          (_MSC_IFC_RAMERR1B_DEFAULT << 16)  /**< Shifted mode DEFAULT for MSC_IFC */
#define MSC_IFC_RAMERR2B                                  (0x1UL << 17)                      /**< Clear RAMERR2B Interrupt Flag */
#define _MSC_IFC_RAMERR2B_SHIFT                           17                                 /**< Shift value for MSC_RAMERR2B */
#define _MSC_IFC_RAMERR2B_MASK                            0x20000UL                          /**< Bit mask for MSC_RAMERR2B */
#define _MSC_IFC_RAMERR2B_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for MSC_IFC */
#define MSC_IFC_RAMERR2B_DEFAULT                          (_MSC_IFC_RAMERR2B_DEFAULT << 17)  /**< Shifted mode DEFAULT for MSC_IFC */
#define MSC_IFC_RAM1ERR1B                                 (0x1UL << 18)                      /**< Clear RAM1ERR1B Interrupt Flag */
#define _MSC_IFC_RAM1ERR1B_SHIFT                          18                                 /**< Shift value for MSC_RAM1ERR1B */
#define _MSC_IFC_RAM1ERR1B_MASK                           0x40000UL                          /**< Bit mask for MSC_RAM1ERR1B */
#define _MSC_IFC_RAM1ERR1B_DEFAULT                        0x00000000UL                       /**< Mode DEFAULT for MSC_IFC */
#define MSC_IFC_RAM1ERR1B_DEFAULT                         (_MSC_IFC_RAM1ERR1B_DEFAULT << 18) /**< Shifted mode DEFAULT for MSC_IFC */
#define MSC_IFC_RAM1ERR2B                                 (0x1UL << 19)                      /**< Clear RAM1ERR2B Interrupt Flag */
#define _MSC_IFC_RAM1ERR2B_SHIFT                          19                                 /**< Shift value for MSC_RAM1ERR2B */
#define _MSC_IFC_RAM1ERR2B_MASK                           0x80000UL                          /**< Bit mask for MSC_RAM1ERR2B */
#define _MSC_IFC_RAM1ERR2B_DEFAULT                        0x00000000UL                       /**< Mode DEFAULT for MSC_IFC */
#define MSC_IFC_RAM1ERR2B_DEFAULT                         (_MSC_IFC_RAM1ERR2B_DEFAULT << 19) /**< Shifted mode DEFAULT for MSC_IFC */

/* Bit fields for MSC IEN */
#define _MSC_IEN_RESETVALUE                               0x00000000UL                       /**< Default value for MSC_IEN */
#define _MSC_IEN_MASK                                     0x000F017FUL                       /**< Mask for MSC_IEN */
#define MSC_IEN_ERASE                                     (0x1UL << 0)                       /**< ERASE Interrupt Enable */
#define _MSC_IEN_ERASE_SHIFT                              0                                  /**< Shift value for MSC_ERASE */
#define _MSC_IEN_ERASE_MASK                               0x1UL                              /**< Bit mask for MSC_ERASE */
#define _MSC_IEN_ERASE_DEFAULT                            0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_ERASE_DEFAULT                             (_MSC_IEN_ERASE_DEFAULT << 0)      /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_WRITE                                     (0x1UL << 1)                       /**< WRITE Interrupt Enable */
#define _MSC_IEN_WRITE_SHIFT                              1                                  /**< Shift value for MSC_WRITE */
#define _MSC_IEN_WRITE_MASK                               0x2UL                              /**< Bit mask for MSC_WRITE */
#define _MSC_IEN_WRITE_DEFAULT                            0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_WRITE_DEFAULT                             (_MSC_IEN_WRITE_DEFAULT << 1)      /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_CHOF                                      (0x1UL << 2)                       /**< CHOF Interrupt Enable */
#define _MSC_IEN_CHOF_SHIFT                               2                                  /**< Shift value for MSC_CHOF */
#define _MSC_IEN_CHOF_MASK                                0x4UL                              /**< Bit mask for MSC_CHOF */
#define _MSC_IEN_CHOF_DEFAULT                             0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_CHOF_DEFAULT                              (_MSC_IEN_CHOF_DEFAULT << 2)       /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_CMOF                                      (0x1UL << 3)                       /**< CMOF Interrupt Enable */
#define _MSC_IEN_CMOF_SHIFT                               3                                  /**< Shift value for MSC_CMOF */
#define _MSC_IEN_CMOF_MASK                                0x8UL                              /**< Bit mask for MSC_CMOF */
#define _MSC_IEN_CMOF_DEFAULT                             0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_CMOF_DEFAULT                              (_MSC_IEN_CMOF_DEFAULT << 3)       /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_PWRUPF                                    (0x1UL << 4)                       /**< PWRUPF Interrupt Enable */
#define _MSC_IEN_PWRUPF_SHIFT                             4                                  /**< Shift value for MSC_PWRUPF */
#define _MSC_IEN_PWRUPF_MASK                              0x10UL                             /**< Bit mask for MSC_PWRUPF */
#define _MSC_IEN_PWRUPF_DEFAULT                           0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_PWRUPF_DEFAULT                            (_MSC_IEN_PWRUPF_DEFAULT << 4)     /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_ICACHERR                                  (0x1UL << 5)                       /**< ICACHERR Interrupt Enable */
#define _MSC_IEN_ICACHERR_SHIFT                           5                                  /**< Shift value for MSC_ICACHERR */
#define _MSC_IEN_ICACHERR_MASK                            0x20UL                             /**< Bit mask for MSC_ICACHERR */
#define _MSC_IEN_ICACHERR_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_ICACHERR_DEFAULT                          (_MSC_IEN_ICACHERR_DEFAULT << 5)   /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_WDATAOV                                   (0x1UL << 6)                       /**< WDATAOV Interrupt Enable */
#define _MSC_IEN_WDATAOV_SHIFT                            6                                  /**< Shift value for MSC_WDATAOV */
#define _MSC_IEN_WDATAOV_MASK                             0x40UL                             /**< Bit mask for MSC_WDATAOV */
#define _MSC_IEN_WDATAOV_DEFAULT                          0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_WDATAOV_DEFAULT                           (_MSC_IEN_WDATAOV_DEFAULT << 6)    /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_LVEWRITE                                  (0x1UL << 8)                       /**< LVEWRITE Interrupt Enable */
#define _MSC_IEN_LVEWRITE_SHIFT                           8                                  /**< Shift value for MSC_LVEWRITE */
#define _MSC_IEN_LVEWRITE_MASK                            0x100UL                            /**< Bit mask for MSC_LVEWRITE */
#define _MSC_IEN_LVEWRITE_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_LVEWRITE_DEFAULT                          (_MSC_IEN_LVEWRITE_DEFAULT << 8)   /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAMERR1B                                  (0x1UL << 16)                      /**< RAMERR1B Interrupt Enable */
#define _MSC_IEN_RAMERR1B_SHIFT                           16                                 /**< Shift value for MSC_RAMERR1B */
#define _MSC_IEN_RAMERR1B_MASK                            0x10000UL                          /**< Bit mask for MSC_RAMERR1B */
#define _MSC_IEN_RAMERR1B_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAMERR1B_DEFAULT                          (_MSC_IEN_RAMERR1B_DEFAULT << 16)  /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAMERR2B                                  (0x1UL << 17)                      /**< RAMERR2B Interrupt Enable */
#define _MSC_IEN_RAMERR2B_SHIFT                           17                                 /**< Shift value for MSC_RAMERR2B */
#define _MSC_IEN_RAMERR2B_MASK                            0x20000UL                          /**< Bit mask for MSC_RAMERR2B */
#define _MSC_IEN_RAMERR2B_DEFAULT                         0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAMERR2B_DEFAULT                          (_MSC_IEN_RAMERR2B_DEFAULT << 17)  /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAM1ERR1B                                 (0x1UL << 18)                      /**< RAM1ERR1B Interrupt Enable */
#define _MSC_IEN_RAM1ERR1B_SHIFT                          18                                 /**< Shift value for MSC_RAM1ERR1B */
#define _MSC_IEN_RAM1ERR1B_MASK                           0x40000UL                          /**< Bit mask for MSC_RAM1ERR1B */
#define _MSC_IEN_RAM1ERR1B_DEFAULT                        0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAM1ERR1B_DEFAULT                         (_MSC_IEN_RAM1ERR1B_DEFAULT << 18) /**< Shifted mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAM1ERR2B                                 (0x1UL << 19)                      /**< RAM1ERR2B Interrupt Enable */
#define _MSC_IEN_RAM1ERR2B_SHIFT                          19                                 /**< Shift value for MSC_RAM1ERR2B */
#define _MSC_IEN_RAM1ERR2B_MASK                           0x80000UL                          /**< Bit mask for MSC_RAM1ERR2B */
#define _MSC_IEN_RAM1ERR2B_DEFAULT                        0x00000000UL                       /**< Mode DEFAULT for MSC_IEN */
#define MSC_IEN_RAM1ERR2B_DEFAULT                         (_MSC_IEN_RAM1ERR2B_DEFAULT << 19) /**< Shifted mode DEFAULT for MSC_IEN */

